app/Filament/Customer/Pages/BecomeVendor.php

select * from `vendor_validations` where `user_id` = 9 order by `created_at` desc limit 1
---
    public static function getNavigationBadge(): ?string
    {
        $user = Auth::user();

        // Get the latest validation for this user
        $latest = VendorValidation::where('user_id', $user->id)
            ->latest()
            ->first();