app/Filament/Customer/Pages/ChatPage.php

select count(*) as aggregate from `chat_messages` where `receiver_id` = 9 and `is_read` is null
---
    protected static function getUnreadMessageCount(): int
    {
        return ChatMessage::where('receiver_id', Auth::id())
            ->whereNull('is_read')
            ->count();