app/Filament/Customer/Pages/MyOrders.php

select count(*) as aggregate from `orders` where `created_by` = 9 and `status` = 'pending'
---
    public static function getNavigationBadge(): ?string
    {
        return (string) Order::where('created_by', Auth::id())
            ->where('status', 'pending')
            ->count();

select count(*) as aggregate from `orders` where `created_by` = 9 and `status` = 'pending'
---
    public static function getNavigationBadgeColor(): ?string
    {
        $count = Order::where('created_by', Auth::id())
            ->where('status', 'pending')
            ->count();