app/Filament/Customer/Pages/PlaceOrder.php

    public function mount(): void
    {
        //  Load & sanitize old cart
        $this->cart = session()->get('cart', []);

        // Auto-fix legacy cart structure
        $this->cart = collect($this->cart)->mapWithKeys(function ($item, $key) {
            if (!isset($item['product_id']) && isset($item['product']) && $item['product'] instanceof Product) {
                $item['product_id'] = $item['product']->id;
            }
            return [$key => $item];
        })->toArray();

        // Save back sanitized cart
        session()->put('cart', $this->cart);

        // Load categories and products
        $this->categories = ShirtCategory::all();
        $this->recommendedProducts = Product::where('quantity_available', '>', 0)->inRandomOrder()->limit(4)->get();
---
select * from `shirt_categories`
select * from `products` where `quantity_available` > 0 order by RAND() limit 4

    protected function loadProducts(): void
    {
        if ($this->selectedCategory === 'recommendations') {
            $this->products = $this->recommendedProducts;
            return;
        }

        $query = Product::where('quantity_available', '>', 0)->with('shirtCategory');

        if ($this->selectedCategory) {
            $query->where('shirt_category_id', $this->selectedCategory);
        }

        $this->products = $query->get();
---
select * from `products` where `quantity_available` > 0
select * from `shirt_categories` where `shirt_categories`.`id` in (1, 2, 3, 4, 5)

    protected function loadWishlistProductIds(): void
    {
        $this->wishlistProductIds = Wishlist::where('user_id', Auth::id())
            ->pluck('product_id')
            ->toArray();
---
select `product_id` from `wishlists` where `user_id` = 9

    public function openProductModal(int $productId): void
    {
        $this->clickedProduct = Product::find($productId);
---
select * from `products` where `products`.`id` = 6 limit 1

    public function calculateCartTotal(): int
    {
        return collect($this->cart)->reduce(function ($total, $item) {
            //  Ensure product_id exists or recover from old structure
            if (!isset($item['product_id'])) {
                if (isset($item['product']) && $item['product'] instanceof Product) {
                    $item['product_id'] = $item['product']->id;
                } else {
                    return $total; // skip invalid items
                }
            }

            $product = Product::find($item['product_id']);
            if (!$product) return $total;

            $qty = $item['quantity'] ?? 1;
            return $total + ($product->unit_price * $qty);
        }, 0);
---
select * from `products` where `products`.`id` = 6 limit 1

    public function getProductCartItemsProperty()
    {
        return collect($this->cart)->mapWithKeys(function ($item, $key) {
            //  Fix legacy items
            if (!isset($item['product_id']) && isset($item['product']) && $item['product'] instanceof Product) {
                $item['product_id'] = $item['product']->id;
            }

            $productId = $item['product_id'] ?? null;
            $product   = $productId ? Product::find($productId) : null;

            if (!$product) return [];

            return [
                $key => [
                    'product'  => $product,
                    'size'     => $item['size'],
                    'quantity' => $item['quantity'],
                ],
            ];
        });
---
select * from `products` where `products`.`id` = 6 limit 1